[
    {
        "id": 1,
        "name": "Royalty",
        "children": [
            
        ]
    },
    {
        "id": 2,
        "name": "Nobles",
        "children": []
    }, 
    {
        "id": 3,
        "name": "Royal Guards",
        "children": [
            {
                "type": "row",
                "class": "",
                "style": "",
                "text": "",
                "children": [
                    {
                        "type": "column",
                        "class": "",
                        "style": "text-align: start;",
                        "text": "",
                        "cols": "12",
                        "children": [
                            {
                                "type": "span",
                                "class": "",
                                "style": "",
                                "text": "The royal guards mostly consist of nobles, knights, and distinguished warriors. They are charged with protecting the peace within the royal district and castle."
                            },
                            {
                                "type": "newLine"
                            },
                            {
                                "type": "newLine"
                            },
                            {
                                "type": "span",
                                "class": "",
                                "style": "",
                                "text": "Several years ago, the Royal Guards started a training program to identify and discover gifted individuals at a young age that have potential for greatness. Upon completing the training program, the candidates are tested and are admitted into the ranks of the Royal Guards upon passing."
                            }
                            
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": 4,
        "name": "City Guard",
        "children": [
            
            {
                "type": "row",
                "class": "",
                "style": "",
                "text": "",
                "children": [
                    {
                        "type": "column",
                        "class": "",
                        "style": "text-align: start;",
                        "text": "",
                        "cols": "12",
                        "children": [
                            {
                                "type": "span",
                                "class": "",
                                "style": "",
                                "text": "The city guards are the city's police force - they are charged with protecting the peace throughout the city. The city guard is broken down into several different departments, and there are a multitude of professions and duties, such as gate guarding, patrolling the streets, performing inspections, investigating crimes, breaking up fights, and so on."
                            },
                            {
                                "type": "newLine"
                            },
                            {
                                "type": "newLine"
                            },
                            {
                                "type": "span",
                                "class": "",
                                "style": "",
                                "text": "One of the departments within the City Guards is called RGR - the Royal Guard Rejects. This department consists exclusively of individuals that were kicked out of the Royal Guards, or (more recently) disqualified from the RG Training program."
                            },
                            {
                                "type": "newLine"
                            },
                            {
                                "type": "newLine"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]
